#pragma once

/// @brief Вычисляет собственные значения и собственные векторы симметричной матрицы 3×3.
///
/// Используется итерационный метод вращений Якоби. Полученные собственные
/// значения и соответствующие им собственные векторы используются при
/// вычислении нормалей методом PCA.
///
/// @param A Исходная симметричная матрица.
/// @param eigenvalues Массив из 3 элементов для собственных значений.
/// @param eigenvectors Матрица 3x3, столбцы которой являются собственными векторами.
void computeEigenVectors3x3(const double A[3][3], double eigenvalues[3], double eigenvectors[3][3]);